In [1]:
# Import modules
import pandas as pd
import numpy as np

# Read names into a dataframe: bnames
bnames=pd.read_csv('names.csv')
bnames.head()

        name sex  births  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [3]:
bnames.shape

(1891894, 4)

In [2]:
bnames.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1891894 entries, 0 to 1891893
Data columns (total 4 columns):
name      object
sex       object
births    int64
year      int64
dtypes: int64(2), object(2)
memory usage: 57.7+ MB

In [5]:
bnames.columns

Index(['name', 'sex', 'births', 'year'], dtype='object')

In [6]:
bnames.name.value_counts(dropna=False).head()

Lee        274
Sidney     274
William    274
Ollie      274
Francis    274
Name: name, dtype: int64

In [7]:
bnames['name'].value_counts(dropna=False).head()

Lee        274
Sidney     274
William    274
Ollie      274
Francis    274
Name: name, dtype: int64

In [8]:
bnames.describe()

             births          year
count  1.891894e+06  1.891894e+06
mean   1.821106e+02  1.974122e+03
std    1.544197e+03  3.386497e+01
min    5.000000e+00  1.880000e+03
25%    7.000000e+00  1.951000e+03
50%    1.200000e+01  1.984000e+03
75%    3.200000e+01  2.002000e+03
max    9.968500e+04  2.016000e+03

In [9]:
bnames['births'].describe()

count    1.891894e+06
mean     1.821106e+02
std      1.544197e+03
min      5.000000e+00
25%      7.000000e+00
50%      1.200000e+01
75%      3.200000e+01
max      9.968500e+04
Name: births, dtype: float64

In [52]:
top5=bnames.head(5).copy()
top5['Char']=top5['name'].astype(str).str[0]
top5=top5.set_index('name')
print(top5)

          sex  births  year Char
name
Mary        F    7065  1880    M
Anna        F    2604  1880    A
Emma        F    2003  1880    E
Elizabeth   F    1939  1880    E
Minnie      F    1746  1880    M

In [53]:
top5=bnames.head(5).copy()
top5['Char']=top5.name.str[0]
top5=top5.set_index('name')
print(top5)

          sex  births  year Char
name
Mary        F    7065  1880    M
Anna        F    2604  1880    A
Emma        F    2003  1880    E
Elizabeth   F    1939  1880    E
Minnie      F    1746  1880    M

In [11]:
# Selecting value from the DataFrame

In [12]:
print(top5.loc[:])

          sex  births  year Char
name
Mary        F    7065  1880    M
Anna        F    2604  1880    A
Emma        F    2003  1880    E
Elizabeth   F    1939  1880    E
Minnie      F    1746  1880    M

In [13]:
df=top5.loc[::2]
print(df)

       sex  births  year Char
name
Mary     F    7065  1880    M
Emma     F    2003  1880    E
Minnie   F    1746  1880    M

In [14]:
df=top5.loc[::-1]
print(df)

          sex  births  year Char
name
Minnie      F    1746  1880    M
Elizabeth   F    1939  1880    E
Emma        F    2003  1880    E
Anna        F    2604  1880    A
Mary        F    7065  1880    M

In [15]:
df=top5.loc[::-1]
print(df)

          sex  births  year Char
name
Minnie      F    1746  1880    M
Elizabeth   F    1939  1880    E
Emma        F    2003  1880    E
Anna        F    2604  1880    A
Mary        F    7065  1880    M

In [16]:
df=top5.loc['Minnie']
print(df)

sex          F
births    1746
year      1880
Char         M
Name: Minnie, dtype: object

In [17]:
df=top5.loc['Mary':'Anna']
print(df)

     sex  births  year Char
name
Mary   F    7065  1880    M
Anna   F    2604  1880    A

In [18]:
df=top5.loc['Mary', 'births':'year']
print(df)

births    7065
year      1880
Name: Mary, dtype: object

In [19]:
# Querying the DataFrame

In [20]:
# select * where name = Isabella
df=bnames[bnames['name']=='Isabella']
print(df.head(20))

           name sex  births  year
214    Isabella   F      50  1880
2217   Isabella   F      50  1881
4197   Isabella   F      44  1882
6306   Isabella   F      54  1883
8361   Isabella   F      76  1884
10733  Isabella   F      48  1885
12965  Isabella   F      80  1886
15408  Isabella   F      58  1887
17800  Isabella   F      63  1888
20415  Isabella   F      80  1889
23005  Isabella   F      91  1890
25716  Isabella   F      79  1891
28382  Isabella   F      88  1892
31270  Isabella   F     109  1893
34137  Isabella   F      92  1894
37096  Isabella   F      90  1895
40150  Isabella   F      88  1896
43244  Isabella   F      86  1897
46294  Isabella   F      86  1898
49528  Isabella   F      94  1899

In [21]:
# select * where name=Isabella and births>= 2011
df=bnames.loc[((bnames['name']=='Isabella') & (bnames['year']>=2011))]
print(df)

             name sex  births  year
1691897  Isabella   F   19891  2011
1715378  Isabella   M      26  2011
1725791  Isabella   F   19089  2012
1750378  Isabella   M      18  2012
1759507  Isabella   F   17617  2013
1783755  Isabella   M      18  2013
1792760  Isabella   F   17054  2014
1816677  Isabella   M      20  2014
1825967  Isabella   F   15574  2015
1849600  Isabella   M      21  2015
1859030  Isabella   F   14722  2016
1885053  Isabella   M      11  2016

In [22]:
# select name where births=19891
df=bnames['name'][bnames['births']==19891]
print(df)

628867      Gregory
1691897    Isabella
Name: name, dtype: object

In [23]:
# bnames_top5: A dataframe with top 5 popular male and female names for the decade
# select sex, name, births where the 2011 after birth
top5 = bnames[bnames['year']>=2011].loc[:,['sex','name','births']]
print(top5.head(20))

        sex       name  births
1691896   F     Sophia   21833
1691897   F   Isabella   19891
1691898   F       Emma   18791
1691899   F     Olivia   17315
1691900   F        Ava   15491
1691901   F      Emily   14247
1691902   F    Abigail   13245
1691903   F    Madison   12374
1691904   F        Mia   11525
1691905   F      Chloe   10983
1691906   F  Elizabeth   10078
1691907   F       Ella    9585
1691908   F    Addison    9295
1691909   F    Natalie    8633
1691910   F       Lily    8176
1691911   F      Grace    7629
1691912   F   Samantha    7392
1691913   F      Avery    7337
1691914   F      Sofia    7325
1691915   F     Aubrey    7171

In [24]:
# create two distinct group 
f=top5[top5['sex']=='F']
m=top5[top5['sex']=='M']
print(f.head(20))
print(m.head(20))

        sex       name  births
1691896   F     Sophia   21833
1691897   F   Isabella   19891
1691898   F       Emma   18791
1691899   F     Olivia   17315
1691900   F        Ava   15491
1691901   F      Emily   14247
1691902   F    Abigail   13245
1691903   F    Madison   12374
1691904   F        Mia   11525
1691905   F      Chloe   10983
1691906   F  Elizabeth   10078
1691907   F       Ella    9585
1691908   F    Addison    9295
1691909   F    Natalie    8633
1691910   F       Lily    8176
1691911   F      Grace    7629
1691912   F   Samantha    7392
1691913   F      Avery    7337
1691914   F      Sofia    7325
1691915   F     Aubrey    7171
        sex         name  births
1711450   M        Jacob   20356
1711451   M        Mason   19503
1711452   M      William   17331
1711453   M       Jayden   16979
1711454   M         Noah   16848
1711455   M      Michael   16775
1711456   M        Ethan   16677
1711457   M    Alexander   15695
1711458   M        Aiden   15487
1711459   M       Daniel   15269
1711460   M      Anthony   14260
1711461   M      Matthew   14157
1711462   M       Elijah   13955
1711463   M       Joshua   13753
1711464   M         Liam   13432
1711465   M       Andrew   13267
1711466   M        James   13239
1711467   M        David   13215
1711468   M     Benjamin   13057
1711469   M  Christopher   12988

In [25]:
# aggregate the birth by name
f_agg=f.groupby(['name','sex']).agg('sum')#.sort('births',ascending=False)
m_agg=m.groupby(['name','sex']).agg('sum')#.sort('births',ascending=False)
print(f_agg.head(20))

               births
name      sex
Aabha     F        35
Aabriella F        21
Aada      F         5
Aadhira   F        51
Aadhvika  F         9
Aadhya    F      1132
Aadi      F        11
Aadison   F         5
Aaditri   F        32
Aadrika   F        19
Aadriti   F         5
Aadvi     F         7
Aadvika   F        33
Aadya     F       728
Aafia     F         6
Aafiya    F         6
Aafiyah   F         5
Aagna     F         7
Aahana    F       278
Aahna     F        58

In [26]:
# select the top 5 in each group
f_agg_top5=f_agg.head(5).copy()
m_agg_top5=m_agg.head(5).copy()
print(m_agg_top5)

           births
name  sex
Aaban M        76
Aabid M         5
Aabir M         5
Aadam M       103
Aadan M        53

In [27]:
# concat the groups
frames=[f_agg_top5, m_agg_top5]
bnames_top5=pd.concat(frames)
print(bnames_top5)

               births
name      sex
Aabha     F        35
Aabriella F        21
Aada      F         5
Aadhira   F        51
Aadhvika  F         9
Aaban     M        76
Aabid     M         5
Aabir     M         5
Aadam     M       103
Aadan     M        53

In [28]:
#print(bnames_top5)
#bnames_top5=bnames_top5.loc[:,['sex','name','births']]
bnames_top5 = bnames_top5.reset_index()
print(bnames_top5.loc[:].to_string(index=False))

name sex  births
    Aabha   F      35
Aabriella   F      21
     Aada   F       5
  Aadhira   F      51
 Aadhvika   F       9
    Aaban   M      76
    Aabid   M       5
    Aabir   M       5
    Aadam   M     103
    Aadan   M      53

In [29]:
# calculation like sum, avg, percentage
# Percentage 1 = value 1 / Sum (eg: 50/90 on hungary)
# Percentage 2 = value 1 / sum of column (eg: 50/260)
# Percentage 3 = value 1 / total sum (eg: 50/400)

In [30]:
xlsFile='ExcelToLoad.xlsx'
xl = pd.ExcelFile(xlsFile)
# calculated fields: sum, percentage, percentage 2, percentage 3
df_result = xl.parse('data final')
print(df_result)

    ID  Country  Value 1  Value 2  Sum  Percentage 1  Percentage 2  \
0  1.0  Hungary       50       40   90      0.555556      0.192308
1  2.0  Germany      100       30  130      0.769231      0.384615
2  3.0  England       40       20   60      0.666667      0.153846
3  4.0      USA       70       50  120      0.583333      0.269231
4  NaN      NaN      260      140  400           NaN           NaN

   Percentage 3
0         0.125
1         0.250
2         0.100
3         0.175
4           NaN

In [31]:
df = xl.parse('data')
print(df)

   ID  Country  Value 1  Value 2
0   1  Hungary       50       40
1   2  Germany      100       30
2   3  England       40       20
3   4      USA       70       50

In [32]:
# Melt the data from column base into one table base
# The id_vars represent the columns of the data you do not want to melt
# value_vars represent the columns you do wish to melt into rows
dfmelt=pd.melt(frame=df, id_vars='Country', value_vars=['Value 1', 'Value 2'])
print(dfmelt)

   Country variable  value
0  Hungary  Value 1     50
1  Germany  Value 1    100
2  England  Value 1     40
3      USA  Value 1     70
4  Hungary  Value 2     40
5  Germany  Value 2     30
6  England  Value 2     20
7      USA  Value 2     50

In [33]:
#re-name the columns in the melt
dfmelt=pd.melt(frame=df, id_vars='Country', value_vars=['Value 1', 'Value 2'], var_name='Values', value_name='measures')
print(dfmelt)

   Country   Values  measures
0  Hungary  Value 1        50
1  Germany  Value 1       100
2  England  Value 1        40
3      USA  Value 1        70
4  Hungary  Value 2        40
5  Germany  Value 2        30
6  England  Value 2        20
7      USA  Value 2        50

In [49]:
# Pivoting data opposite of melting
dfpivot=dfmelt.pivot_table(index='Country', columns='Values', values='measures')
dfpivot=dfpivot.reset_index()
print(dfpivot.head())

Values  Country  Value 1  Value 2
0       England       40       20
1       Germany      100       30
2       Hungary       50       40
3           USA       70       50

In [34]:
# Sum of Value 1 sum, mean, min, max are the same
sum=df['Value 1'].sum()
print(sum)

260

In [35]:
#Sum of values per country
sum=df['Value 1']+df['Value 2']
print(sum)

0     90
1    130
2     60
3    120
dtype: int64

In [36]:
#Sum of values per country to Hungary
sum=df['Value 1']+df['Value 2']
print(sum[0])

90

In [37]:
#Sum of values per country
sum=(df['Value 1']+df['Value 2']).sum()
print(sum)

400

In [38]:
# Percentage 1
perc1=df['Value 1'] / (df['Value 1']+df['Value 2'])
print(perc1)

0    0.555556
1    0.769231
2    0.666667
3    0.583333
dtype: float64

In [39]:
# Percentage 2
perc2=df['Value 1'] / df['Value 1'].sum()
print(perc2)

0    0.192308
1    0.384615
2    0.153846
3    0.269231
Name: Value 1, dtype: float64

In [40]:
# Percentage 3
perc3=df['Value 1'] / (df['Value 1']+df['Value 2']).sum()
print(perc3)

0    0.125
1    0.250
2    0.100
3    0.175
Name: Value 1, dtype: float64

In [41]:
# attributes and methods list
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html